import React from "react";

const CampaignTypes = [
  {
    name: "Brand awareness campaign",

    hintText: {
      am: <>բրենդի ճանաչելիությունը բարձրացնող գովազդային արշավ</>,
      en: <></>,
      ru: <></>,
    },
  },
  {
    name: "Brand launch campaign",

    hintText: {
      am: (
        <>
          բոլորովին նոր կամ արդեն գոյություն ունեցող բրենդի կողմից նորաստեղծ
          բրենդի ճանաչելիությունը բարձրացնող գովազդային արշավ
        </>
      ),
      en: <></>,
      ru: <></>,
    },
  },
  {
    name: "Product/service launch campaign",

    hintText: {
      am: (
        <>նոր պրոդուկտ, ծառայություն առաջխաղացնող / իրազեկող գովազդային արշավ</>
      ),
      en: <></>,
      ru: <></>,
    },
  },
  {
    name: "Rebranding campaign",

    hintText: {
      am: (
        <>
          կազմակերպության վերաբրենդավորման, նոր տարբերանշանի, անվանման փոփոխման
          կամ մեկ այլ կազմակերպության հետ միանալու, ևն մասին գովազդային արշավ
        </>
      ),
      en: <></>,
      ru: <></>,
    },
  },
  {
    name: "Seasonal push campaign",

    hintText: {
      am: <>սեզոնային բնույթի ապրանքներ, ծառայություններ գովազդող արշավ</>,
      en: <></>,
      ru: <></>,
    },
  },
  {
    name: "Corporate social responsibility (CSR) campaign",

    hintText: {
      am: (
        <>
          գովազդային արշավ ուղղված գլոբալ խնդիրներ լուծելու և համամարդկային
          հարցեր բարձրացնելու գործին։ Գենդերային հավասարություն, շրջակա
          միջավայր, պատերազմներ և այլն
        </>
      ),
      en: <></>,
      ru: <></>,
    },
  },
  {
    name: "Contest marketing campaign",

    hintText: {
      am: <>գովազդային արշավ խաղարկությունների միջոցով</>,
      en: <></>,
      ru: <></>,
    },
  },
  {
    name: "Ecommerce campaign",

    hintText: {
      am: (
        <>
          օնլայն կամ օֆլայն տիրույթներում օնլայն վաճառքների խթանմանը միտված
          գովազդային արշավ
        </>
      ),
      en: <></>,
      ru: <></>,
    },
  },
  {
    name: "Lead generation campaign",

    hintText: {
      am: <>նոր հաճախորդների ներգրավումը բարձրացնող գովազդային արշավ</>,
      en: <></>,
      ru: <></>,
    },
  },
  {
    name: "Teaser campaign",

    hintText: {
      am: (
        <>
          նախնական փուլում սակավ ինֆորմացիա տվող և դրանով իսկ դեպի պրոդուկտը /
          բրենդը / ծառայությունը շատ հետաքրքրություն առաջացնող գովազդային արշավ
        </>
      ),
      en: <></>,
      ru: <></>,
    },
  },
  {
    name: "Other",
    hintText: false,
  },
];

export default CampaignTypes;
