import React from "react";

const CampaignTypes = [
  {
    name: "Brand awareness campaign",

    hintText: {
      am: <>բրենդի ճանաչելիությունը բարձրացնող գովազդային արշավ</>,
      en: <></>,
      ru: <>Рекламная кампания по повышению узнаваемости бренда</>,
    },
  },
  {
    name: "Brand launch campaign",

    hintText: {
      am: (
        <>
          բոլորովին նոր կամ արդեն գոյություն ունեցող բրենդի կողմից նորաստեղծ
          բրենդի ճանաչելիությունը բարձրացնող գովազդային արշավ
        </>
      ),
      en: <></>,
      ru: (
        <>
          Рекламная кампания, обеспечивающая выход на рынок полностью нового
          бренда или созданного существующим брендом нового бренда
        </>
      ),
    },
  },
  {
    name: "Product/service launch campaign",

    hintText: {
      am: (
        <>նոր պրոդուկտ, ծառայություն առաջխաղացնող / իրազեկող գովազդային արշավ</>
      ),
      en: <></>,
      ru: (
        <>
          Рекламная кампания, осведомляющая о выходе на рынок нового
          продукта/услуги
        </>
      ),
    },
  },
  {
    name: "Rebranding campaign",

    hintText: {
      am: (
        <>
          կազմակերպության վերաբրենդավորման, նոր տարբերանշանի, անվանման փոփոխման
          կամ մեկ այլ կազմակերպության հետ միանալու, ևն մասին գովազդային արշավ
        </>
      ),
      en: <></>,
      ru: (
        <>
          Рекламная кампания о ребрендинге, новом логотипе, смене названия или
          присоединению к другой компании и пр.
        </>
      ),
    },
  },
  {
    name: "Seasonal push campaign",

    hintText: {
      am: <>սեզոնային բնույթի ապրանքներ, ծառայություններ գովազդող արշավ</>,
      en: <></>,
      ru: <>Рекламная кампания сезонных товаров и услуг</>,
    },
  },
  {
    name: "Corporate social responsibility (CSR) campaign",

    hintText: {
      am: (
        <>
          գովազդային արշավ ուղղված գլոբալ խնդիրներ լուծելու և համամարդկային
          հարցեր բարձրացնելու գործին։ Գենդերային հավասարություն, շրջակա
          միջավայր, պատերազմներ և այլն
        </>
      ),
      en: <></>,
      ru: (
        <>
          Рекламная кампания, направленная на решение социальных проблем и
          общечеловеческих вопросов: гендерное равенство, окружающая среда,
          войны и т.п.
        </>
      ),
    },
  },
  {
    name: "Contest marketing campaign",

    hintText: {
      am: <>գովազդային արշավ խաղարկությունների միջոցով</>,
      en: <></>,
      ru: <>Рекламная кампания посредством розыгрышей</>,
    },
  },
  {
    name: "Ecommerce campaign",

    hintText: {
      am: (
        <>
          օնլայն կամ օֆլայն տիրույթներում օնլայն վաճառքների խթանմանը միտված
          գովազդային արշավ
        </>
      ),
      en: <></>,
      ru: (
        <>
          Кампания по онлайн-продвижению бизнеса, привлечение новых клиентов с
          помощью цифровых инструментов
        </>
      ),
    },
  },
  {
    name: "Lead generation campaign",

    hintText: {
      am: <>նոր հաճախորդների ներգրավումը բարձրացնող գովազդային արշավ</>,
      en: <></>,
      ru: <>Рекламная кампания по привлечению новых клиентов</>,
    },
  },
  {
    name: "Teaser campaign",

    hintText: {
      am: (
        <>
          նախնական փուլում սակավ ինֆորմացիա տվող և դրանով իսկ դեպի պրոդուկտը /
          բրենդը / ծառայությունը շատ հետաքրքրություն առաջացնող գովազդային արշավ
        </>
      ),
      en: <></>,
      ru: (
        <>
          Рекламная кампания, которая предоставляет мало информации на начальном
          этапе, тем самым подготавливая платформу для запуска кампании, а также
          вызывая усиленный интерес к товару/бренду/услуге
        </>
      ),
    },
  },
  {
    name: "Other",
    hintText: false,
  },
];

export default CampaignTypes;
