const Disclaimer = {
  am: (
    <>
      <p>
        Այս փաստաթուղթը պարունակում է գաղտնի տեղեկատվություն, որը չպետք է
        պատճենվի կամ տարածվի առանց թույլտվության:
      </p>

      <p>
        Եթե դուք սխալմամբ եք ստացել այս փաստաթուղթը, խնդրում ենք տեղեկացնել
        ուղարկողին և ջնջել այն ձեր համակարգից: Խնդրում ենք նկատի ունենալ, որ
        Ընկերության գրառումների արդյունավետ պահպանման համար, որոնք կարող են
        պահանջվել դատական գործընթացների հետ կապված, այս փաստաթղթի հեղինակին
        ուղարկված բոլոր փաստաթղթերը կպատճառվեն և կպահպանվեն անվտանգ պահոցում:
      </p>
    </>
  ),
  en: "",
  ru: "",
};

export default Disclaimer;
